---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltCoating
source: html/7e5c59a2-bc8e-0b72-9cb6-4fead1ebedbd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltCoating Property

"Coating"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemBoltCoating { get; }
```